package com.goit.oop.interfaces.antipattern;

/**
 * Клас Constants, який використовується для зберігання констант.
 * Це є прикладом хорошої практики код стайлу, оскільки константи зберігаються в класі, де вони використовуються.
 * Тут також дотримуються принципи ООП, такі як інкапсуляція, оскільки константи не стають глобальними та доступними для всіх класів.
 */
public class Constants {

    /**
     * Статична фінальна змінна SECRET_KEY, яка використовується як константа.
     */
    public static final String SECRET_KEY = "dfsfzffvdfvzfvzfv";
}